Revit 2027 API
ImageExportOptions.FilePath Property
 The file name and path for the exported file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string FilePath { get; set; }
Public Property FilePath As String
	Get
	Set
public:
property String^ FilePath {
	String^ get ();
	void set (String^ value);
}
member FilePath : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The input file path is not valid.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 If ExportRange is SetOfViews, the name of each view or sheet will be appended to the name provided for each exported file. This field is ignored if used to save an image to a project as a new view.
See Also
Reference
ImageExportOptions Class
Autodesk.Revit.DB Namespace